In [1]:
import numpy as np
import pandas as pd

In [2]:
r=pd.Series(np.array([1,2,3,4,5]))
r

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [3]:
r=pd.Series(np.array([1,2,3,4,5]),index=[1,2,3,4,5])
r

1    1
2    2
3    3
4    4
5    5
dtype: int32

In [4]:
r=pd.Series(np.array([1,2,3,4,5]),index=['a','b','c','d','e'])
r

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [5]:
r=pd.Series(np.array([1,2,3,4,5]),index=['a','b','c','d','e'],name='roll no',dtype=float)
r

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: roll no, dtype: float64

In [6]:
r=pd.Series(np.array([1,2,3,4,5]),index=['a','b','c','d','e'],name='roll no')
r

a    1
b    2
c    3
d    4
e    5
Name: roll no, dtype: int32

In [7]:
d={'a1':99,'a2':32,'a3':67,'a4':95,'a5':78}
d.items()

dict_items([('a1', 99), ('a2', 32), ('a3', 67), ('a4', 95), ('a5', 78)])

In [8]:
marks=pd.Series(d)
print(marks)

a1    99
a2    32
a3    67
a4    95
a5    78
dtype: int64

In [9]:
marks=pd.Series(d,name='S Marks')
print(marks)

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S Marks, dtype: int64

In [10]:
marks=pd.Series(d,name='S Marks',dtype='str')
print(marks)

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S Marks, dtype: object

In [11]:
marks['a1']

'99'

In [12]:
# how to get multiple values
marks['a1':'a4']

a1    99
a2    32
a3    67
a4    95
Name: S Marks, dtype: object

In [13]:
#ilocation - it defines index values
## location - it defines index positions
marks

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S Marks, dtype: object

In [14]:
marks.iloc[0]

'99'

In [15]:
marks.loc['a1']

'99'

In [16]:
marks.iloc[0:4]

a1    99
a2    32
a3    67
a4    95
Name: S Marks, dtype: object

In [18]:
marks.loc['a1':'a4']

a1    99
a2    32
a3    67
a4    95
Name: S Marks, dtype: object

In [22]:
#select random values
import random
random.randint(1,10)

9

In [26]:
# operators using pandas
b = pd.Series(np.array([5,4,8,1,9]),index=list('ABCDE'),name='grades')
b

A    5
B    4
C    8
D    1
E    9
Name: grades, dtype: int32

In [27]:
b>6

A    False
B    False
C     True
D    False
E     True
Name: grades, dtype: bool

In [29]:
b[b>6]

C    8
E    9
Name: grades, dtype: int32

In [30]:
b*10

A    50
B    40
C    80
D    10
E    90
Name: grades, dtype: int32

In [31]:
# statistical operators
b.mean()

5.4

In [34]:
(5+4+8)/3

5.666666666666667

In [35]:
b['A':'C'].mean()

5.666666666666667

In [36]:
b['A']=21
b

A    21
B     4
C     8
D     1
E     9
Name: grades, dtype: int32

- probably the most important data structure of pandas is the DataFrame. its a tabular structure tightly intigrated with series

In [48]:
ms_marks={'sub1':[99,94,89,96,85,79,80,68,92,76],
          'sub2':[65,75,46,87,98,43,45,65,59,78],
          'sub3':[14,24,34,21,19,20,40,34,49,58],
          'sub4':[45,67,87,95,91,76,84,59,70,50]}

In [49]:
marks=pd.DataFrame(ms_marks,index=['surekha','vani','vijaya','lakshmi','durga','vasavi','varun','geetha','siva','vamsi'])
marks

         sub1  sub2  sub3  sub4
surekha    99    65    14    45
vani       94    75    24    67
vijaya     89    46    34    87
lakshmi    96    87    21    95
durga      85    98    19    91
vasavi     79    43    20    76
varun      80    45    40    84
geetha     68    65    34    59
siva       92    59    49    70
vamsi      76    78    58    50

In [51]:
marks.loc['surekha'].sum()

223

In [53]:
marks.index

Index(['surekha', 'vani', 'vijaya', 'lakshmi', 'durga', 'vasavi', 'varun',
       'geetha', 'siva', 'vamsi'],
      dtype='object')

In [54]:
marks.columns

Index(['sub1', 'sub2', 'sub3', 'sub4'], dtype='object')

In [55]:
marks.shape

(10, 4)

In [56]:
marks.describe()

            sub1       sub2       sub3       sub4
count  10.000000  10.000000  10.000000  10.000000
mean   85.800000  66.100000  31.300000  72.400000
std     9.930872  18.591814  14.353087  17.270399
min    68.000000  43.000000  14.000000  45.000000
25%    79.250000  49.250000  20.250000  61.000000
50%    87.000000  65.000000  29.000000  73.000000
75%    93.500000  77.250000  38.500000  86.250000
max    99.000000  98.000000  58.000000  95.000000

In [57]:
marks['sub1']

surekha    99
vani       94
vijaya     89
lakshmi    96
durga      85
vasavi     79
varun      80
geetha     68
siva       92
vamsi      76
Name: sub1, dtype: int64

In [58]:
marks[['sub1','sub4']]

         sub1  sub4
surekha    99    45
vani       94    67
vijaya     89    87
lakshmi    96    95
durga      85    91
vasavi     79    76
varun      80    84
geetha     68    59
siva       92    70
vamsi      76    50

In [59]:
marks[['sub2','sub4']]

         sub2  sub4
surekha    65    45
vani       75    67
vijaya     46    87
lakshmi    87    95
durga      98    91
vasavi     43    76
varun      45    84
geetha     65    59
siva       59    70
vamsi      78    50

In [62]:
marks[marks>70]

         sub1  sub2  sub3  sub4
surekha  99.0   NaN   NaN   NaN
vani     94.0  75.0   NaN   NaN
vijaya   89.0   NaN   NaN  87.0
lakshmi  96.0  87.0   NaN  95.0
durga    85.0  98.0   NaN  91.0
vasavi   79.0   NaN   NaN  76.0
varun    80.0   NaN   NaN  84.0
geetha    NaN   NaN   NaN   NaN
siva     92.0   NaN   NaN   NaN
vamsi    76.0  78.0   NaN   NaN

In [71]:
marks.sub1['varun']

80

In [72]:
marks.iloc[0][0:3]

sub1    99
sub2    65
sub3    14
Name: surekha, dtype: int64

In [73]:
marks.iloc[0][3]

45

In [74]:
marks.iloc[1]

sub1    94
sub2    75
sub3    24
sub4    67
Name: vani, dtype: int64

In [75]:
marks.iloc[3][0:2]

sub1    96
sub2    87
Name: lakshmi, dtype: int64

In [76]:
marks

         sub1  sub2  sub3  sub4
surekha    99    65    14    45
vani       94    75    24    67
vijaya     89    46    34    87
lakshmi    96    87    21    95
durga      85    98    19    91
vasavi     79    43    20    76
varun      80    45    40    84
geetha     68    65    34    59
siva       92    59    49    70
vamsi      76    78    58    50

In [77]:
marks.iloc[5]

sub1    79
sub2    43
sub3    20
sub4    76
Name: vasavi, dtype: int64

In [80]:
marks.iloc[7][2]

34

In [81]:
marks['sub5']=[10,12,15,17,32,17,19,18,32,20]

In [82]:
marks

         sub1  sub2  sub3  sub4  sub5
surekha    99    65    14    45    10
vani       94    75    24    67    12
vijaya     89    46    34    87    15
lakshmi    96    87    21    95    17
durga      85    98    19    91    32
vasavi     79    43    20    76    17
varun      80    45    40    84    19
geetha     68    65    34    59    18
siva       92    59    49    70    32
vamsi      76    78    58    50    20

In [84]:
# how to drop columns
marks.drop(columns='sub5')

         sub1  sub2  sub3  sub4
surekha    99    65    14    45
vani       94    75    24    67
vijaya     89    46    34    87
lakshmi    96    87    21    95
durga      85    98    19    91
vasavi     79    43    20    76
varun      80    45    40    84
geetha     68    65    34    59
siva       92    59    49    70
vamsi      76    78    58    50

In [85]:
marks

         sub1  sub2  sub3  sub4  sub5
surekha    99    65    14    45    10
vani       94    75    24    67    12
vijaya     89    46    34    87    15
lakshmi    96    87    21    95    17
durga      85    98    19    91    32
vasavi     79    43    20    76    17
varun      80    45    40    84    19
geetha     68    65    34    59    18
siva       92    59    49    70    32
vamsi      76    78    58    50    20

In [ ]:
# drop columns perminentely from dataframes using axis=1
marks.drop(columns='sub5',axis=1,inplace=True)

In [102]:
marks

         sub1  sub2  sub3  sub4
surekha    99    65    14    45
vani       94    75    24    67
vijaya     89    46    34    87
lakshmi    96    87    21    95
durga      85    98    19    91
vasavi     79    43    50    76
varun      80    45    40    84
geetha     68    65    34    59
vamsi      76    78    58    50

In [92]:
marks.drop('siva',inplace=True)

In [93]:
marks

         sub1  sub2  sub3  sub4
surekha    99    65    14    45
vani       94    75    24    67
vijaya     89    46    34    87
lakshmi    96    87    21    95
durga      85    98    19    91
vasavi     79    43    20    76
varun      80    45    40    84
geetha     68    65    34    59
vamsi      76    78    58    50

In [99]:
# updation
marks.iloc[5][2]=50

In [100]:
marks

         sub1  sub2  sub3  sub4
surekha    99    65    14    45
vani       94    75    24    67
vijaya     89    46    34    87
lakshmi    96    87    21    95
durga      85    98    19    91
vasavi     79    43    50    76
varun      80    45    40    84
geetha     68    65    34    59
vamsi      76    78    58    50

In [104]:
marks['sub3']=100
marks

         sub1  sub2  sub3  sub4
surekha    99    65   100    45
vani       94    75   100    67
vijaya     89    46   100    87
lakshmi    96    87   100    95
durga      85    98   100    91
vasavi     79    43   100    76
varun      80    45   100    84
geetha     68    65   100    59
vamsi      76    78   100    50

In [105]:
marks.iloc[:][3]=0

In [111]:
import pandas as pd

In [114]:
# read csv from external files using read_csv function
pop_data=pd.read_csv('population.csv')
pop_data

    2001   2002  2003  2004  2005  2006  2007  2008  2009   2010
0     91   91.5    90    95    92    96    98    94    97   99.6
1    120  121.9   125   130   131   120   130   131   134  137.0
2     91   91.5    90    95    92    96    98    94    97   99.6
3    120  121.9   125   130   131   120   130   131   134  137.0
4     91   91.5    90    95    92    96    98    94    97   99.6
5    120  121.9   125   130   131   120   130   131   134  137.0
6     91   91.5    90    95    92    96    98    94    97   99.6
7    120  121.9   125   130   131   120   130   131   134  137.0
8     91   91.5    90    95    92    96    98    94    97   99.6
9    120  121.9   125   130   131   120   130   131   134  137.0
10    91   91.5    90    95    92    96    98    94    97   99.6
11   120  121.9   125   130   131   120   130   131   134  137.0
12    91   91.5    90    95    92    96    98    94    97   99.6
13   120  121.9   125   130   131   120   130   131   134  137.0

In [118]:
pop_data.index

RangeIndex(start=0, stop=14, step=1)

In [123]:
pop_data.index=['India','China','Sri Lanka','NorthKorea','SouthKorea','USA','Dubai','Afganisthan','Newzealand','Japan','Delhi','Kerala','Nellore','Vijayawada']

In [124]:
pop_data

             2001   2002  2003  2004  2005  2006  2007  2008  2009   2010
India          91   91.5    90    95    92    96    98    94    97   99.6
China         120  121.9   125   130   131   120   130   131   134  137.0
Sri Lanka      91   91.5    90    95    92    96    98    94    97   99.6
NorthKorea    120  121.9   125   130   131   120   130   131   134  137.0
SouthKorea     91   91.5    90    95    92    96    98    94    97   99.6
USA           120  121.9   125   130   131   120   130   131   134  137.0
Dubai          91   91.5    90    95    92    96    98    94    97   99.6
Afganisthan   120  121.9   125   130   131   120   130   131   134  137.0
Newzealand     91   91.5    90    95    92    96    98    94    97   99.6
Japan         120  121.9   125   130   131   120   130   131   134  137.0
Delhi          91   91.5    90    95    92    96    98    94    97   99.6
Kerala        120  121.9   125   130   131   120   130   131   134  137.0
Nellore        91   91.5    90    95    92    96    98    94    97   99.6
Vijayawada    120  121.9   125   130   131   120   130   131   134  137.0

In [127]:
studentdata=pd.read_excel('studentdata.xlsx')
studentdata

  Student   Sub1  Sub2  Sub3  Sub4  Sub5
0  surekha    70    89    67    78    89
1     vani    75    79    68    87    76
2   vijaya    83    69    40    95    85
3  mounika    59    60    59    70    57
4    kiran    49    59    60    50    87
5    vikas    76    75    37    48    98
6    varun    98    76    85    60    87
7    priya    60    81    70    65    79
8   anusha    80    50    60    76    76